#+STARTUP: inlineimages, hidestars, indent,  overview
#+STARTUP: entitiespretty
#+bibliography:~/org/articles/bigbibfile.bib
#+org-download-image-dir: "/Volumes/Dala/org/pictures/"
#+PROPERTY:header-args :results output :session :cache yes :tangle yes :comments org :exports both 

To test in benchmark:
Have large array for variable which needs to be updated by same function and distribute 
-- OR --
have local class objects or small arrays that are updated locally
-- OR --

Possible issues with giant synapse :
1. Synaptic transmission failure --- This will break the giant synapse
2. Minis -- can be fixed with
3. stdp -- also can be fixed

Use pyNN for setup network --> get a very simple simulator to work 

*** Presyn
#+BEGIN_SRC python 
timeit.repeat('presyn_call(st,no_neurons)','from __main__ import presyn_call, st, no_neurons', number=100, repeat=3)
#+END_SRC

#+RESULTS:
: [0.05292437199386768, 0.05272999100270681, 0.049857275997055694]

#+BEGIN_SRC python 
timeit.repeat('call_Isum(st, Isum, inp_index, inp_index_si, no_neurons)','from __main__ import call_Isum, st, Isum, inp_index, inp_index_si, no_neurons', number=100, repeat=3)
#+END_SRC

#+RESULTS:
: [0.6209825909973006, 0.6187705129996175, 0.6199506030025077]

*** Postsyn

#+BEGIN_SRC python 
timeit.repeat('postsyn_call(pst, inp_index, inp_index_si, no_neurons)','from __main__ import postsyn_call, pst, inp_index, inp_index_si, no_neurons', number=100, repeat=3)
#+END_SRC

#+RESULTS:
: [32.089919095997175, 32.655966313002864, 32.60898096600431]

